In [74]:
import pandas as pd
import numpy as np

data = pd.read_csv('WA_Fn-UseC_-Telco-Customer-Churn.csv')  
data.head(3)

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,Yes,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,No,Yes,No,No,No,One year,No,Mailed check,56.95,1889.5,No
2,3668-QPYBK,Male,0,No,No,2,Yes,No,DSL,Yes,Yes,No,No,No,No,Month-to-month,Yes,Mailed check,53.85,108.15,Yes

In [75]:
pd.set_option('display.max_columns', None)

In [76]:
a_slice=data[["Partner","Churn"]]
a_slice.groupby("Partner").count()

#data[["gender","Monthlycharges"]].group.by("gender").mean() Another way to do it

         Churn
Partner
No        3641
Yes       3402

In [88]:
data[["gender","Partner","InternetService","MonthlyCharges"]].groupby(["gender","Partner","InternetService"]).mean()

                                MonthlyCharges
gender Partner InternetService
Female No      DSL                   54.753479
               Fiber optic           88.389367
               No                    20.735797
       Yes     DSL                   62.751140
               Fiber optic           95.076816
               No                    21.432463
Male   No      DSL                   53.232677
               Fiber optic           88.580603
               No                    20.719187
       Yes     DSL                   62.302341
               Fiber optic           94.410897
               No                    21.483780

In [89]:
data[["TotalCharges"]]= pd.to_numeric(data["TotalCharges"],errors='coerce')

data[["TotalCharges","Partner"]].groupby(["Partner"]).median()

         TotalCharges
Partner
No              811.8
Yes            2347.9

In [86]:
data[["gender","Partner","MonthlyCharges"]].groupby(["gender","Partner"]).mean()

                MonthlyCharges
gender Partner
Female No            63.874111
       Yes           66.622630
Male   No            60.058854
       Yes           68.912398

In [77]:
churn_data = data["Churn"].count()
print("Churn total count is:", churn_data)

Churn total count is: 7043

In [84]:
data[["gender","InternetService"]].groupby("gender")["InternetService"].get_group("Female").value_counts().to_frame("%")/data[["gender"]].groupby("gender").get_group("Female").value_counts().sum()*100

                     %
Fiber optic  44.524083
DSL          34.059633
No           21.416284

In [78]:
data[["Partner","Churn"]].groupby("Partner").count()/data["Churn"].count()*100

            Churn
Partner
No       51.69672
Yes      48.30328

In [82]:
data[["gender"]].groupby("gender").size()
print(3488/(3488+3555)*100)

#print(data[['gender', "Partner"]].value_counts(normalize=True) * 100)

49.5243504188556

In [83]:
data.groupby("Partner")["gender"].value_counts(normalize=True) * 100

Partner  gender
No       Male      50.563032
         Female    49.436968
Yes      Male      50.382128
         Female    49.617872
Name: gender, dtype: float64

In [73]:
int_service_data = data.groupby('gender')['InternetService'].value_counts()

fem_fiber_per = int_service_data["Female"]["Fiber optic"] / int_service_data["Female"].sum() * 100

print(fem_fiber_per) #percentage of fiber optic with female Internet Services

44.52408256880734

In [ ]:
data[["Partner","Churn"]].groupby("Partner").count()/data["Churn"].count()*100

In [63]:
my_slice=data[["gender","MonthlyCharges"]]
my_slice.groupby("gender").mean()

        MonthlyCharges
gender
Female       65.204243
Male         64.327482

In [64]:
data[["gender","MonthlyCharges"]].groupby("gender").mean()

        MonthlyCharges
gender
Female       65.204243
Male         64.327482

In [65]:
data.groupby("gender").mean()

        SeniorCitizen     tenure  MonthlyCharges
gender
Female       0.162844  32.244553       65.204243
Male         0.161463  32.495359       64.327482

In [66]:
data[["PaymentMethod","MonthlyCharges"]].groupby("PaymentMethod").mean().sort_values("MonthlyCharges")

                           MonthlyCharges
PaymentMethod
Mailed check                    43.917060
Credit card (automatic)         66.512385
Bank transfer (automatic)       67.192649
Electronic check                76.255814

In [67]:
data[["gender","PaymentMethod","MonthlyCharges"]].groupby(["gender","PaymentMethod"]).mean()

                                  MonthlyCharges
gender PaymentMethod
Female Bank transfer (automatic)       67.662373
       Credit card (automatic)         67.731782
       Electronic check                75.737350
       Mailed check                    44.431170
Male   Bank transfer (automatic)       66.703042
       Credit card (automatic)         65.321494
       Electronic check                76.763431
       Mailed check                    43.437470

In [68]:
data["TotalCharges"].dtype

dtype('O')